Revit 2027 API
ElectricalSystem.Create Method
Overload List
Name | Description
Create(Connector, ElectricalSystemType) |  Creates a new MEP Electrical System element from an unused Connector.
Create(Document, IList<ElementId>, ElectricalSystemType) |  Creates a new MEP Electrical System element from a set of electrical components.
Top
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace